// Report when the last policy was applied for each DeviceName with PolicyName and PolicyID
DeviceEvents
| where ActionType contains "AppControlCodeIntegrityPolicyLoaded"
| extend PolicyName = parsejson(AdditionalFields).PolicyName
| extend PolicyID = parsejson(AdditionalFields).PolicyID
| summarize LastTimeGenerated = arg_max(Timestamp, *) by DeviceName
| project LastTimeGenerated, DeviceName, PolicyName, PolicyID
